#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.vehicle_data_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.vehicle_data_function.local_file.archive_plan[0]: Refreshing state... [id=2614fd7814969a71ccb1cf26be81acadd214ee57]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=55b2448a43b0e307e4eda2baa8806b5457a6ab5b]
module.vehicle_data_function.null_resource.archive[0]: Refreshing state... [id=4932011328460503651]
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.charing_history_exporter_function.local_file.archive_plan[0]: Refreshing state... [id=4fa2966c4b8f2ddcca52662d61cb3d3ee2a78322]
module.history_slicer_function.local_file.archive_plan[0]: Refreshing state... [id=8b0f25e2036f08de617f38c1f28b9110d52161fe]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=4154834496500103867]
module.charing_history_exporter_function.null_resource.archive[0]: Refreshing state... [id=2959212091726569885]
module.history_slicer_function.null_resource.archive[0]: Refreshing state... [id=7183703417477881647]
module.history_slicer_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/history-slicer]
module.history_slicer_function.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001]
aws_cloudwatch_event_rule.vehicle_data: Refreshing state... [id=tesla-data-exporter20231002185714156700000001]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_region.current: Reading...
module.lambda_layer_s3.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_partition.current: Reading...
module.vehicle_data_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.vehicle_data.aws_dynamodb_table.this[0]: Refreshing state... [id=vehicle-data]
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tesla-data-exporter]
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
data.aws_caller_identity.current: Reading...
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.s3_bucket.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.history_slicer_function.data.aws_partition.current: Reading...
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.vehicle_data_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/vehicle-data]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=tde-slicer]
module.vehicle_data_function.aws_iam_role.lambda[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_iam_role.lambda[0]: Refreshing state... [id=tesla-data-exporter]
module.history_slicer_function.aws_iam_role.lambda[0]: Refreshing state... [id=history-slicer]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4275475925]
module.history_slicer_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-logs]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4225016675]
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.vehicle_data_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-logs]
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=290343876]
data.aws_iam_policy_document.vehicle_data: Reading...
data.aws_iam_policy_document.vehicle_data: Read complete after 0s [id=1837894490]
module.charing_history_exporter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter-logs]
module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tesla-data-exporter-20231001175840578300000002]
module.vehicle_data_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=vehicle-data-20231001174846802700000003]
module.history_slicer_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=history-slicer-20231001174846812600000004]
data.aws_iam_policy_document.history_exporter: Reading...
data.aws_iam_policy_document.history_slicer: Reading...
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=tesla-data-exporter]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_exporter: Read complete after 0s [id=3850528508]
data.aws_iam_policy_document.history_slicer: Read complete after 0s [id=3487884030]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=tesla-data-exporter]
module.lambda_layer_s3.aws_s3_object.lambda_package[0]: Refreshing state... [id=lambda-builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=tesla-data-exporter,private]
module.lambda_layer_s3.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2]
module.history_slicer_function.aws_lambda_function.this[0]: Refreshing state... [id=history-slicer]
module.charing_history_exporter_function.aws_lambda_function.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.aws_lambda_function.this[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
aws_cloudwatch_event_target.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001-terraform-20231001175918661000000004]
module.vehicle_data_function.aws_lambda_permission.unqualified_alias_triggers["AtMidnight"]: Refreshing state... [id=AtMidnight]
module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"]: Refreshing state... [id=s3]
module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"]: Refreshing state... [id=AtMidnight]
module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
aws_s3_bucket_notification.slicer: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vehicle_data_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "vehicle-data"
      ~ last_modified                  = "2023-10-02T18:57:42.000+0000" -> "2023-10-02T18:57:48.082+0000"
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ handler                        = "function.handler" -> "export_history.handler"
        id                             = "tesla-data-exporter"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "EveryEightHours" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2959212091726569885" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696273027492331000" -> "1696274537576809800"
            # (1 unchanged element hidden)
        }
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ handler                        = "function.handler" -> "slice_history.handler"
        id                             = "history-slicer"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:history-slicer:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:history-slicer:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "s3" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.history_slicer_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7183703417477881647" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696273027508519000" -> "1696274537620668800"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-10-02T18:57:26.064+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies" -> (known after apply)
      ~ s3_key                      = "lambda-builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      ~ s3_object_version           = "NwynIjq.TtQWbrVnndVWEpxvXSMuiCAZ" # forces replacement -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "NskpRC4zeZdNbIr9AiWwDCbL2TmUfCs0SvZOf6eH2AI=" -> (known after apply)
      ~ source_code_size            = 14503221 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f2c89cf47bc9516266ae024b17f7d2a0-3" -> (known after apply)
      ~ id                     = "lambda-builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip" -> (known after apply)
      ~ key                    = "lambda-builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./.terraform/lambda_builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      - tags                   = {} -> null
      ~ version_id             = "NwynIjq.TtQWbrVnndVWEpxvXSMuiCAZ" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/packages",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4154834496500103867" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/3f07be12b411ae19275bd4475251d323abd0be71677fd24fbad57f2f9cd899d1.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
          ~ "timestamp" = "1696273028130254000" -> "1696274537586552000"
        }
    }

  # module.vehicle_data_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ handler                        = "function.handler" -> "mileage_tracker.handler"
        id                             = "vehicle-data"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AtMidnight" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vehicle_data_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4932011328460503651" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696273027496303000" -> "1696274537530579000"
            # (1 unchanged element hidden)
        }
    }

Plan: 10 to add, 3 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*